en/expressions/operators.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>operators</title>
<!-- 2018-12-13 jeu. 08:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="emile" />
</head>
<body>
<div id="content">
<h1 class="title">operators</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Operators</a>
<ul>
<li><a href="#sec-1-1">1.1. Type promotion</a></li>
<li><a href="#sec-1-2">1.2. Special type promotion</a></li>
<li><a href="#sec-1-3">1.3. Operator precedence</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Operators</h2>
<div class="outline-text-2" id="text-1">
<p>
The operators as in any language refers to the symbols used to perform operation between values.
The precedence of the operators is defined in the table below.
</p>

<p>
```ymir
let a = 1 + 3 * 4;
assert (a == 13);
```
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Type promotion</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Operations on primitive types are allowed by the <b><b>Ymir</b></b> language
only if they do not generate a loss of accuracy. This is called type
promotion, and is defined by: A type <i>x</i> can be transformed into type
<i>y</i> if and only if the size of the type <i>x</i> is smaller than the size
of <i>y</i> and <i>x</i> and <i>y</i> are of the same nature. That is, <i>x</i> and <i>y</i>
are both unsigned, or both signed, or both are floating.
</p>

<p>
```ymir
let a = 12; <i>/ i32
let b = 12B; /</i> i8
b = a; <i>/ Illegal
a = b; /</i> Ok
</p>

<p>
let c = 34UB; <i>/ u8
b = c; /</i> Illegal
a = c; // Illegal
```
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Special type promotion</h3>
<div class="outline-text-3" id="text-1-2">
<p>
It is possible to override promotions of types that can be
sometimes annoying to do some calculations. For this purpose, there are
two ways. The first one is quite classic, it is the cast of the type
. An example is shown below, but the cast is explained more in
detail in this section [Type cast](expressions/cast.md).
</p>

<p>
```ymir
let a = 12; <i>/ i32
let b = 12B; /</i> i8
b = cast!i8 (a); // Ok
</p>

<p>
let c = 34UB;
b = cast!i8 (c); <i>/ Ok
a = cast!i32 (c); /</i> Ok
```
</p>

<p>
The cast can sometimes be a little too verbose, which is why <b><b>Ymir</b></b>
also offers an automatic cast system for types from a typed
operation. To do this, it is possible to type an operator in order to
define which type of operation you want to perform.
</p>

<p>
```ymir
let a = 12;
let b = 12B;
</p>

<p>
let c = a + b; <i>/ Illegal
let d = a +:i32 b; /</i> Okay, an i32 operation will be applied
</p>

<p>
<i>/ This operation will be rewritten by the compiler into
/</i> let d = cast!i32 (a) + cast!i32 (b); 
```
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Operator precedence</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">priority</th>
<th scope="col" class="left">description</th>
<th scope="col" class="left">operators</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left">Assignement operators</td>
<td class="left">`/=` `&amp;=` `&vert;=` `-=` `+=` `<a id="" name=""></a>=` `=` `*=` `%=` `^=` `^^=` `~=`</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">Logical or</td>
<td class="left">`&vert;&vert;`</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">Logical and</td>
<td class="left">`&amp;&amp;`</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">Test operators</td>
<td class="left">`&lt;` `&gt;` `&lt;=` `&gt;=` `!=` `!&lt;` `!&lt;=` `!&gt;` `!&gt;=` `==` `is` `!is` `of` `!of`</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left">Range operators</td>
<td class="left">`..` `&#x2026;`</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left">bit shift operators</td>
<td class="left">`<a id="" name=""></a>`</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">bitwise operation</td>
<td class="left">`&vert;` `<sup>`</sup> `&amp;`</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">Additive operators</td>
<td class="left">`+` `~` `-`</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left">Multiplicatives operators</td>
<td class="left">`*` `/` `%`</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left">Unary operators</td>
<td class="left">`++` `&#x2013;` `!` `-` `&amp;` `*`</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left">Postfix operators</td>
<td class="left">`(` `.` `[`</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: emile</p>
<p class="date">Created: 2018-12-13 jeu. 08:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
